; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v7 ?v10)
             (pred_7 ?v8 ?v5)
             (pred_10 ?v7 ?v5)
             (pred_2 ?v9 ?v7 )
	     (pred_12 ?v7)
             (pred_4 ?v1)
             (pred_3 ?v8)
             (pred_9 ?v5)
             (pred_5 ?v7)
             (pred_11 ?v8)
             (pred_8 ?v7)
             (pred_1 ))



(:action op_3
:parameters (?v4 ?v11 ?v3 ?v6)
:precondition (and (pred_4 ?v4) (pred_4 ?v11) (pred_3 ?v3) (pred_9 ?v6)
          (pred_6 ?v4 ?v11) (pred_7 ?v3 ?v6)
                   (pred_10 ?v11 ?v6) (pred_12 ?v4) 
                   (pred_5 ?v11) (pred_11 ?v3))
:effect (and  (pred_8 ?v11) (not (pred_5 ?v11))))


(:action op_1
:parameters (?v4 ?v2)
:precondition (and (pred_4 ?v4) (pred_4 ?v2)
               (pred_12 ?v4) (pred_6 ?v4 ?v2) (pred_8 ?v2))
:effect (and (pred_12 ?v2) (not (pred_12 ?v4))))

(:action op_4
:parameters (?v4 ?v3)
:precondition (and (pred_4 ?v4) (pred_3 ?v3) 
                  (pred_12 ?v4) (pred_2 ?v3 ?v4) (pred_1 ))
:effect (and (pred_11 ?v3)
   (not (pred_2 ?v3 ?v4)) (not (pred_1 ))))


(:action op_2
:parameters (?v4 ?v12 ?v13)
:precondition (and (pred_4 ?v4) (pred_3 ?v12) (pred_3 ?v13)
                  (pred_12 ?v4) (pred_11 ?v13) (pred_2 ?v12 ?v4))
:effect (and (pred_11 ?v12) (pred_2 ?v13 ?v4)
        (not (pred_11 ?v13)) (not (pred_2 ?v12 ?v4))))

(:action op_5
:parameters (?v4 ?v3)
:precondition (and (pred_4 ?v4) (pred_3 ?v3) 
                  (pred_12 ?v4) (pred_11 ?v3))
:effect (and (pred_1 ) (pred_2 ?v3 ?v4) (not (pred_11 ?v3)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_27 obj_08 obj_14 obj_23 obj_02 obj_18 obj_07 obj_17 obj_32 obj_28 obj_19 obj_26 obj_22 obj_29 obj_21 obj_13 obj_01 obj_09 obj_16 obj_30 obj_06 obj_11 obj_24 obj_10 obj_31
    obj_04 obj_20 obj_12
    obj_05 obj_15 obj_03 obj_25
    )

    (:init
       (pred_1)

       (pred_4 obj_27)
       (pred_4 obj_08)
       (pred_4 obj_14)
       (pred_4 obj_23)
       (pred_4 obj_02)
       (pred_4 obj_18)
       (pred_4 obj_07)
       (pred_4 obj_17)
       (pred_4 obj_32)
       (pred_4 obj_28)
       (pred_4 obj_19)
       (pred_4 obj_26)
       (pred_4 obj_22)
       (pred_4 obj_29)
       (pred_4 obj_21)
       (pred_4 obj_13)
       (pred_4 obj_01)
       (pred_4 obj_09)
       (pred_4 obj_16)
       (pred_4 obj_30)
       (pred_4 obj_06)
       (pred_4 obj_11)
       (pred_4 obj_24)
       (pred_4 obj_10)
       (pred_4 obj_31)
       (pred_9 obj_04)
       (pred_9 obj_20)
       (pred_9 obj_12)
       (pred_3 obj_05)
       (pred_3 obj_15)
       (pred_3 obj_03)
       (pred_3 obj_25)

       (pred_6 obj_27 obj_18)
       (pred_6 obj_27 obj_08)
       (pred_6 obj_08 obj_07)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_08 obj_27)
       (pred_6 obj_14 obj_17)
       (pred_6 obj_14 obj_23)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_23 obj_32)
       (pred_6 obj_23 obj_02)
       (pred_6 obj_23 obj_14)
       (pred_6 obj_02 obj_28)
       (pred_6 obj_02 obj_23)
       (pred_6 obj_18 obj_19)
       (pred_6 obj_18 obj_07)
       (pred_6 obj_18 obj_27)
       (pred_6 obj_07 obj_26)
       (pred_6 obj_07 obj_17)
       (pred_6 obj_07 obj_08)
       (pred_6 obj_07 obj_18)
       (pred_6 obj_17 obj_22)
       (pred_6 obj_17 obj_32)
       (pred_6 obj_17 obj_14)
       (pred_6 obj_17 obj_07)
       (pred_6 obj_32 obj_29)
       (pred_6 obj_32 obj_28)
       (pred_6 obj_32 obj_23)
       (pred_6 obj_32 obj_17)
       (pred_6 obj_28 obj_21)
       (pred_6 obj_28 obj_02)
       (pred_6 obj_28 obj_32)
       (pred_6 obj_19 obj_13)
       (pred_6 obj_19 obj_26)
       (pred_6 obj_19 obj_18)
       (pred_6 obj_26 obj_01)
       (pred_6 obj_26 obj_22)
       (pred_6 obj_26 obj_07)
       (pred_6 obj_26 obj_19)
       (pred_6 obj_22 obj_09)
       (pred_6 obj_22 obj_29)
       (pred_6 obj_22 obj_17)
       (pred_6 obj_22 obj_26)
       (pred_6 obj_29 obj_16)
       (pred_6 obj_29 obj_21)
       (pred_6 obj_29 obj_32)
       (pred_6 obj_29 obj_22)
       (pred_6 obj_21 obj_30)
       (pred_6 obj_21 obj_28)
       (pred_6 obj_21 obj_29)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_13 obj_01)
       (pred_6 obj_13 obj_19)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_01 obj_26)
       (pred_6 obj_01 obj_13)
       (pred_6 obj_09 obj_24)
       (pred_6 obj_09 obj_16)
       (pred_6 obj_09 obj_22)
       (pred_6 obj_09 obj_01)
       (pred_6 obj_16 obj_10)
       (pred_6 obj_16 obj_30)
       (pred_6 obj_16 obj_29)
       (pred_6 obj_16 obj_09)
       (pred_6 obj_30 obj_31)
       (pred_6 obj_30 obj_21)
       (pred_6 obj_30 obj_16)
       (pred_6 obj_06 obj_11)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_11 obj_24)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_11 obj_06)
       (pred_6 obj_24 obj_10)
       (pred_6 obj_24 obj_09)
       (pred_6 obj_24 obj_11)
       (pred_6 obj_10 obj_31)
       (pred_6 obj_10 obj_16)
       (pred_6 obj_10 obj_24)
       (pred_6 obj_31 obj_30)
       (pred_6 obj_31 obj_10)
       (pred_5 obj_01)
       (pred_5 obj_13)
       (pred_5 obj_06)
       (pred_5 obj_23)
       (pred_10  obj_01 obj_04)
       (pred_10  obj_13 obj_20)
       (pred_10  obj_06 obj_12)
       (pred_10  obj_23 obj_04)
       (pred_8 obj_27)
       (pred_8 obj_08)
       (pred_8 obj_14)
       (pred_8 obj_02)
       (pred_8 obj_18)
       (pred_8 obj_07)
       (pred_8 obj_17)
       (pred_8 obj_32)
       (pred_8 obj_28)
       (pred_8 obj_19)
       (pred_8 obj_26)
       (pred_8 obj_22)
       (pred_8 obj_29)
       (pred_8 obj_21)
       (pred_8 obj_09)
       (pred_8 obj_16)
       (pred_8 obj_30)
       (pred_8 obj_11)
       (pred_8 obj_24)
       (pred_8 obj_10)
       (pred_8 obj_31)

       (pred_7  obj_05 obj_04)
       (pred_7  obj_15 obj_20)
       (pred_7  obj_03 obj_12)
       (pred_7  obj_25 obj_20)
       (pred_2 obj_05 obj_16)
       (pred_2 obj_15 obj_24)
       (pred_2 obj_03 obj_24)
       (pred_2 obj_25 obj_06)
       (pred_12 obj_17)
    )

    (:goal (and
       (pred_2 obj_05 obj_11)
       (pred_2 obj_15 obj_29)
    ))
(:constraints
  (always (not (pred_12 obj_09)))
)
)

; plan
1. (op_1 obj_17 obj_22)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_22)
   goals met: 0 of 2
2. (op_1 obj_22 obj_29)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_29)
   goals met: 0 of 2
3. (op_1 obj_29 obj_16)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_16)
   goals met: 0 of 2
4. (op_4 obj_16 obj_05)
   deleted: (pred_2 obj_05 obj_16) (pred_1)
   added: (pred_11 obj_05)
   goals met: 0 of 2
5. (op_1 obj_16 obj_10)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_10)
   goals met: 0 of 2
6. (op_1 obj_10 obj_24)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_24)
   goals met: 0 of 2
7. (op_1 obj_24 obj_11)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_11)
   goals met: 0 of 2
8. (op_5 obj_11 obj_05)
   deleted: (pred_11 obj_05)
   added: (pred_1) (pred_2 obj_05 obj_11)
   goals met: 1 of 2
9. (op_1 obj_11 obj_24)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_24)
   goals met: 1 of 2
10. (op_4 obj_24 obj_15)
   deleted: (pred_2 obj_15 obj_24) (pred_1)
   added: (pred_11 obj_15)
   goals met: 1 of 2
11. (op_1 obj_24 obj_10)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_10)
   goals met: 1 of 2
12. (op_1 obj_10 obj_16)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_16)
   goals met: 1 of 2
13. (op_1 obj_16 obj_29)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_29)
   goals met: 1 of 2
14. (op_5 obj_29 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_1) (pred_2 obj_15 obj_29)
   goals met: 2 of 2
